dataset_gen/Reynolds_Variation/FPO_cylinder/Regular_easy/Design_Point_0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            patch;
        nFaces          128;
        startFace       32512;
    }
    right
    {
        type            patch;
        nFaces          128;
        startFace       32640;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          128;
        startFace       32768;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          128;
        startFace       32896;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32768;
        startFace       33024;
    }
)

// ************************************************************************* //
